Revit 2027 API
FabricationService.ResetServiceExclusionOverrides Method
 Resets the overridden service palette and button exclusions back to default, as defined by the configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetServiceExclusionOverrides()
Public Sub ResetServiceExclusionOverrides
public:
void ResetServiceExclusionOverrides()
member ResetServiceExclusionOverrides : unit -> unit
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace